# Ритейл — Анализ программы лояльности

## Задача:

Проанализируем программу лояльности магазина.

Проведем исследовательский анализ данных;
Проведем анализ программы лояльности;
Сформулируем и проверим статистические гипотезы.
Проверим гипотезу: средние проверки участников программы лояльности выше, чем у остальных покупателей.
Сформулируем ретроспективную статистическую гипотезу. Дополним ее нулевой и альтернативной гипотезами. Проверим гипотезу с помощью статистического теста.
(задачи выше составлены заранее, окончательная постановка задачи произойдёт на вводной части)

In [1]:
#загрузим нужные библиотеки
import pandas as pd
import numpy as np
from numpy import mean
import math as mth
import datetime as dt
import seaborn as sns
import scipy.stats as st
import plotly.express as px
import matplotlib.pyplot as plt
from plotly import graph_objects as go

In [2]:
#загрузим данные в переменную 'data'

product_codes = \
pd.read_csv("C:\\Users\\kirio\\OneDrive\\Рабочий стол\\ЯПрактикум\\14_Выпускной Проект\\product_codes.csv", sep=',')

retail_dataset = \
pd.read_csv('C:\\Users\\kirio\\OneDrive\\Рабочий стол\\ЯПрактикум\\14_Выпускной Проект\\retail_dataset.csv', sep=',')

In [3]:
product_codes

     productID  price_per_one
0       85123A           2.55
1        71053           3.39
2       84406B           2.75
3       84029G           3.39
4       84029E           3.39
...        ...            ...
9964     84306           8.29
9965    90001A           4.15
9966     90118           2.46
9967       DOT         172.62
9968     20738           0.00

[9969 rows x 2 columns]

In [4]:
retail_dataset

,purchaseid,item_ID,Quantity,purchasedate,CustomerID,ShopID,loyalty_program
0,538280,21873,11,2016-12-10 12:50:00,18427.0,Shop 0,0.0
1,538862,22195,0,2016-12-14 14:11:00,22389.0,Shop 0,1.0
2,538855,21239,7,2016-12-14 13:50:00,22182.0,Shop 0,1.0
3,543543,22271,0,2017-02-09 15:33:00,23522.0,Shop 0,1.0
4,543812,79321,0,2017-02-13 14:40:00,23151.0,Shop 0,1.0
...,...,...,...,...,...,...,...
105330,538566,21826,1,2016-12-13 11:21:00,NaN,Shop 0,0.0
105331,540247,21742,0,2017-01-05 15:56:00,21143.0,Shop 0,0.0
105332,538068,85048,1,2016-12-09 14:05:00,23657.0,Shop 0,1.0
105333,538207,22818,11,2016-12-10 11:33:00,18427.0,Shop 0,0.0
105334,543977,22384,9,2017-02-14 15:35:00,21294.0,Shop 0,0.0